In [4]:
import pandas as pd

In [5]:
titanic_train=pd.read_csv("./train.csv")

In [6]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
data=titanic_train.copy()

In [8]:
type(data)

pandas.core.frame.DataFrame

In [9]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [11]:
dy=data.dtypes

In [12]:
type(dy)

pandas.core.series.Series

In [13]:
dy['Sex']

dtype('O')

In [14]:
dy['Age']

dtype('float64')

In [15]:
dy[0]

dtype('int64')

In [16]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
data['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [18]:
type(data['Age'])

pandas.core.series.Series

In [19]:
data['Age'][10:100]

10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
      ...
95     NaN
96    71.0
97    23.0
98    34.0
99    34.0
Name: Age, Length: 90, dtype: float64

In [20]:
data['Age'][::-1]

890    32.0
889    26.0
888     NaN
887    19.0
886    27.0
       ...
4      35.0
3      35.0
2      26.0
1      38.0
0      22.0
Name: Age, Length: 891, dtype: float64

In [21]:
data['Age'][-1]

KeyError: -1

In [23]:
data['Age'][::2]

0      22.0
2      26.0
4      35.0
6      54.0
8      27.0
       ...
882    22.0
884    25.0
886    27.0
888     NaN
890    32.0
Name: Age, Length: 446, dtype: float64

In [24]:

l1=list(data['Age'][::2])
l1

[22.0,
 26.0,
 35.0,
 54.0,
 27.0,
 4.0,
 20.0,
 14.0,
 2.0,
 31.0,
 35.0,
 15.0,
 8.0,
 nan,
 nan,
 40.0,
 nan,
 28.0,
 nan,
 18.0,
 40.0,
 nan,
 19.0,
 nan,
 nan,
 7.0,
 49.0,
 65.0,
 21.0,
 5.0,
 22.0,
 45.0,
 nan,
 29.0,
 17.0,
 32.0,
 21.0,
 32.0,
 nan,
 0.83,
 22.0,
 nan,
 17.0,
 16.0,
 23.0,
 29.0,
 46.0,
 59.0,
 71.0,
 34.0,
 28.0,
 21.0,
 37.0,
 21.0,
 38.0,
 47.0,
 22.0,
 17.0,
 70.5,
 24.0,
 21.0,
 32.5,
 54.0,
 nan,
 nan,
 33.0,
 47.0,
 25.0,
 19.0,
 16.0,
 nan,
 24.0,
 18.0,
 27.0,
 36.5,
 51.0,
 55.5,
 nan,
 16.0,
 nan,
 44.0,
 26.0,
 1.0,
 nan,
 nan,
 61.0,
 1.0,
 56.0,
 nan,
 30.0,
 nan,
 9.0,
 4.0,
 nan,
 40.0,
 32.0,
 19.0,
 44.0,
 nan,
 nan,
 28.0,
 34.0,
 18.0,
 32.0,
 16.0,
 24.0,
 22.0,
 nan,
 27.0,
 32.0,
 16.0,
 51.0,
 38.0,
 19.0,
 18.0,
 35.0,
 59.0,
 24.0,
 44.0,
 19.0,
 nan,
 29.0,
 30.0,
 25.0,
 37.0,
 nan,
 62.0,
 41.0,
 nan,
 35.0,
 nan,
 52.0,
 nan,
 16.0,
 58.0,
 nan,
 41.0,
 nan,
 45.0,
 7.0,
 65.0,
 16.0,
 nan,
 30.0,
 42.0,
 26.0,
 36.0,
 24.0,
 23.5,
 nan,
 nan,
 19.0,
 nan,
 nan,
 30.0,
 24.0,
 26.0,
 43.0,
 24.0,
 31.0,
 22.0,
 30.0,
 nan,
 61.0,
 31.0,
 nan,
 38.0,
 nan,
 29.0,
 45.0,
 2.0,
 28.0,
 36.0,
 40.0,
 3.0,
 23.0,
 15.0,
 nan,
 22.0,
 nan,
 40.0,
 45.0,
 nan,
 60.0,
 nan,
 25.0,
 19.0,
 3.0,
 22.0,
 20.0,
 42.0,
 32.0,
 nan,
 1.0,
 nan,
 36.0,
 28.0,
 24.0,
 31.0,
 23.0,
 39.0,
 21.0,
 20.0,
 51.0,
 21.0,
 nan,
 33.0,
 44.0,
 34.0,
 30.0,
 nan,
 29.0,
 18.0,
 28.0,
 nan,
 28.0,
 42.0,
 50.0,
 21.0,
 64.0,
 45.0,
 25.0,
 nan,
 13.0,
 5.0,
 36.0,
 30.0,
 nan,
 65.0,
 50.0,
 48.0,
 47.0,
 nan,
 nan,
 nan,
 nan,
 33.0,
 22.0,
 34.0,
 22.0,
 9.0,
 50.0,
 25.0,
 35.0,
 30.0,
 nan,
 55.0,
 21.0,
 54.0,
 25.0,
 17.0,
 nan,
 16.0,
 33.0,
 28.0,
 29.0,
 36.0,
 24.0,
 34.0,
 36.0,
 30.0,
 nan,
 nan,
 50.0,
 39.0,
 2.0,
 17.0,
 30.0,
 45.0,
 nan,
 36.0,
 11.0,
 50.0,
 19.0,
 33.0,
 17.0,
 nan,
 22.0,
 48.0,
 39.0,
 nan,
 28.0,
 nan,
 19.0,
 nan,
 62.0,
 36.0,
 16.0,
 34.0,
 nan,
 25.0,
 54.0,
 nan,
 47.0,
 22.0,
 35.0,
 47.0,
 37.0,
 nan,
 nan,
 24.0,
 nan,
 35.0,
 30.0,
 22.0,
 39.0,
 nan,
 35.0,
 34.0,
 4.0,
 27.0,
 20.0,
 21.0,
 57.0,
 26.0,
 80.0,
 32.0,
 9.0,
 32.0,
 41.0,
 20.0,
 2.0,
 0.75,
 19.0,
 nan,
 nan,
 21.0,
 18.0,
 nan,
 23.0,
 50.0,
 47.0,
 20.0,
 25.0,
 43.0,
 40.0,
 70.0,
 nan,
 24.5,
 43.0,
 nan,
 20.0,
 60.0,
 14.0,
 18.0,
 31.0,
 nan,
 60.0,
 44.0,
 49.0,
 18.0,
 18.0,
 26.0,
 45.0,
 22.0,
 24.0,
 48.0,
 52.0,
 38.0,
 nan,
 6.0,
 34.0,
 27.0,
 30.0,
 25.0,
 29.0,
 nan,
 23.0,
 48.0,
 nan,
 nan,
 21.0,
 31.0,
 16.0,
 19.0,
 4.0,
 33.0,
 48.0,
 28.0,
 34.0,
 nan,
 20.0,
 16.0,
 nan,
 nan,
 24.0,
 57.0,
 54.0,
 nan,
 nan,
 13.0,
 29.0,
 25.0,
 18.0,
 1.0,
 nan,
 nan,
 25.0,
 49.0,
 30.0,
 34.0,
 11.0,
 27.0,
 39.0,
 39.0,
 26.0,
 35.0,
 30.5,
 23.0,
 43.0,
 52.0,
 38.0,
 2.0,
 nan,
 nan,
 15.0,
 nan,
 18.0,
 21.0,
 32.0,
 20.0,
 30.0,
 17.0,
 nan,
 28.0,
 4.0,
 9.0,
 44.0,
 45.0,
 24.0,
 41.0,
 48.0,
 24.0,
 27.0,
 nan,
 26.0,
 33.0,
 28.0,
 20.0,
 nan,
 25.0,
 22.0,
 25.0,
 27.0,
 nan,
 32.0]

In [25]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [26]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [27]:
data.dtypes[data.dtypes=='object'].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [28]:
data[data.dtypes[data.dtypes=='object'].index]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [29]:
data_cat=data[data.dtypes[data.dtypes=='object'].index]
data_cat

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [30]:
data_cat.describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [31]:
data[['Age']]

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [32]:
data['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [33]:

data_null=data[data['Age'].isnull()]
data_null

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [34]:
import numpy as np

data_null_index=np.where(data['Age'].isnull()==True)
data_null_index

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154, 158, 159, 166, 168, 176, 180, 181, 185, 186,
        196, 198, 201, 214, 223, 229, 235, 240, 241, 250, 256, 260, 264,
        270, 274, 277, 284, 295, 298, 300, 301, 303, 304, 306, 324, 330,
        334, 335, 347, 351, 354, 358, 359, 364, 367, 368, 375, 384, 388,
        409, 410, 411, 413, 415, 420, 425, 428, 431, 444, 451, 454, 457,
        459, 464, 466, 468, 470, 475, 481, 485, 490, 495, 497, 502, 507,
        511, 517, 522, 524, 527, 531, 533, 538, 547, 552, 557, 560, 563,
        564, 568, 573, 578, 584, 589, 593, 596, 598, 601, 602, 611, 612,
        613, 629, 633, 639, 643, 648, 650, 653, 656, 667, 669, 674, 680,
        692, 697, 709, 711, 718, 727, 732, 738, 739, 740, 760, 766, 768,
        773, 776, 778, 783, 790, 792, 793, 815, 825, 826, 828, 832, 837,
        839, 846, 849, 859, 863, 868, 878, 888]),)

In [35]:
  data_null

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [36]:
data.iloc[data_null_index]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [37]:
data.iloc[9]

PassengerId                                     10
Survived                                         1
Pclass                                           2
Name           Nasser, Mrs. Nicholas (Adele Achem)
Sex                                         female
Age                                           14.0
SibSp                                            1
Parch                                            0
Ticket                                      237736
Fare                                       30.0708
Cabin                                          NaN
Embarked                                         C
Name: 9, dtype: object

In [38]:
type(data.iloc[9])

pandas.core.series.Series

In [39]:
data.iloc[[1,2,3,4,5]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [40]:
#get the name who pay highest fare
data[data['Fare'] == max(data['Fare'])]['Name']

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [41]:
data[data['Fare']==data['Fare'].max()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

In [42]:
#get name  with age==24
data[data['Age']==24]['Name']

89                                Celotti, Mr. Francesco
118                             Baxter, Mr. Quigg Edmond
127                            Madsen, Mr. Fridtjof Arne
139                                   Giglio, Mr. Victor
142    Hakkarainen, Mrs. Pekka Pietari (Elin Matilda ...
199               Yrois, Miss. Henriette ("Mrs Harbeck")
210                                       Ali, Mr. Ahmed
234                    Leyson, Mr. Robert William Norman
247                      Hamalainen, Mrs. William (Anna)
293                                  Haas, Miss. Aloisia
294                                     Mineff, Mr. Ivan
310                       Hays, Miss. Margaret Bechstein
316                  Kantor, Mrs. Sinai (Miriam Sternin)
341                       Fortune, Miss. Alice Elizabeth
345                        Brown, Miss. Amelia "Mildred"
369                        Aubart, Mme. Leontine Pauline
394    Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...
437                Richards, Mrs. Sidney (Emily Hocking)
499                                   Svensson, Mr. Olof
514                                    Coleff, Mr. Satio
565                                 Davies, Mr. Alfred J
600    Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...
615                                  Herman, Miss. Alice
641                                 Sagesser, Mlle. Emma
655                            Hickman, Mr. Leonard Mark
710     Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")
743                                    McNamee, Mr. Neal
770                               Lievens, Mr. Rene Aime
858                Baclini, Mrs. Solomon (Latifa Qurban)
864                               Gill, Mr. John William
Name: Name, dtype: object

In [43]:
#get the name with minimum age
data[data['Age']==data['Age'].min()]['Name']

803    Thomas, Master. Assad Alexander
Name: Name, dtype: object

In [44]:
data[data['Cabin'].isnull()]['Age']

0      22.0
2      26.0
4      35.0
5       NaN
7       2.0
       ...
884    25.0
885    39.0
886    27.0
888     NaN
890    32.0
Name: Age, Length: 687, dtype: float64

In [45]:
#get the age with null cabin
data[['Age','Cabin']][data.Cabin.isnull()==True]

      Age Cabin
0    22.0   NaN
2    26.0   NaN
4    35.0   NaN
5     NaN   NaN
7     2.0   NaN
..    ...   ...
884  25.0   NaN
885  39.0   NaN
886  27.0   NaN
888   NaN   NaN
890  32.0   NaN

[687 rows x 2 columns]

In [46]:
#name of male passenger who survived
data[((data['Survived']==1) & (data['Sex']=='male'))]['Name']

17        Williams, Mr. Charles Eugene
21               Beesley, Mr. Lawrence
23        Sloper, Mr. William Thompson
36                    Mamee, Mr. Hanna
55                   Woolner, Mr. Hugh
                    ...
838                    Chip, Mr. Chang
839               Marechal, Mr. Pierre
857             Daly, Mr. Peter Denis
869    Johnson, Master. Harold Theodor
889              Behr, Mr. Karl Howell
Name: Name, Length: 109, dtype: object

In [47]:
l=[1,2,3,4,5]

In [48]:
pd.Series(l)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [49]:
d={"name":"hasmukh","surname":"mer","mial_id":"hasmukh@gmail.com"}

In [50]:
pd.DataFrame(d,index=["name","surename","mail_id"])

             name surname            mial_id
name      hasmukh     mer  hasmukh@gmail.com
surename  hasmukh     mer  hasmukh@gmail.com
mail_id   hasmukh     mer  hasmukh@gmail.com

In [51]:
pd.Series(d)

name                 hasmukh
surname                  mer
mial_id    hasmukh@gmail.com
dtype: object

In [52]:
import numpy as np

arr = np.random.randn(3,4)
arr

array([[-0.57673185,  1.29049739, -0.51065115, -1.10067989],
       [-0.07265076, -0.78866992, -1.97979981, -1.35605912],
       [-0.4568473 ,  1.57369832,  1.01953111, -3.6459201 ]])

In [53]:
pd.DataFrame(arr)

          0         1         2         3
0 -0.576732  1.290497 -0.510651 -1.100680
1 -0.072651 -0.788670 -1.979800 -1.356059
2 -0.456847  1.573698  1.019531 -3.645920

In [54]:
pd.Series(arr)

ValueError: Data must be 1-dimensional

In [55]:
ser=pd.Series(np.array([4,5,6,7]),index=['a','b','c','d'])
ser

a    4
b    5
c    6
d    7
dtype: int64

In [56]:
ser.iloc['a']

TypeError: Cannot index by location index with a non-integer key

In [61]:
ser.iloc[2]

6

In [62]:
ser.loc['b']

5

In [63]:
ser1=pd.Series(np.array([4,5,6,7]),index=[45,89,5,6])
ser1

45    4
89    5
5     6
6     7
dtype: int64

In [64]:
ser1.iloc[45]

IndexError: single positional indexer is out-of-bounds

In [70]:
ser1.loc[45]

4

In [71]:
pd.DataFrame(np.random.randint(3,6,(4,5)))

   0  1  2  3  4
0  3  3  5  5  3
1  5  3  5  5  5
2  5  4  3  4  5
3  3  5  3  4  4

In [72]:
data2=pd.DataFrame(np.random.randint(3,6,(4,5)),index=['a','b','c','d'],columns=['u','x','y','z','w'])
data2

   u  x  y  z  w
a  5  4  4  3  5
b  5  5  5  5  4
c  4  3  5  3  5
d  3  4  3  5  3

In [73]:
data2.loc["c":"d","y":"z"]

   y  z
c  5  3
d  3  5

In [74]:
  data2

   u  x  y  z  w
a  5  4  4  3  5
b  5  5  5  5  4
c  4  3  5  3  5
d  3  4  3  5  3

In [75]:
data2['new']=data2.z + data2.w

In [76]:
data2

   u  x  y  z  w  new
a  5  4  4  3  5    8
b  5  5  5  5  4    9
c  4  3  5  3  5    8
d  3  4  3  5  3    8

In [77]:
data.drop('x')

KeyError: "['x'] not found in axis"

In [80]:
data2.drop('x',axis=1)

   u  y  z  w  new
a  5  4  3  5    8
b  5  5  5  4    9
c  4  5  3  5    8
d  3  3  5  3    8

In [81]:
data2

   u  x  y  z  w  new
a  5  4  4  3  5    8
b  5  5  5  5  4    9
c  4  3  5  3  5    8
d  3  4  3  5  3    8

In [82]:
data2.drop('x',axis=1,inplace=True)
data2

   u  y  z  w  new
a  5  4  3  5    8
b  5  5  5  4    9
c  4  5  3  5    8
d  3  3  5  3    8

In [83]:
data2.drop('c',inplace=True)

In [84]:
data2

   u  y  z  w  new
a  5  4  3  5    8
b  5  5  5  4    9
d  3  3  5  3    8

In [85]:
np.random.seed(23
               )
data3=pd.DataFrame(np.random.randn(4,5))
data3

          0         1         2         3         4
0  0.666988  0.025813 -0.777619  0.948634  0.701672
1 -1.051082 -0.367548 -1.137460 -1.322148  1.772258
2 -0.347459  0.670140  0.322272  0.060343 -1.043450
3 -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [86]:
data3.values[data3.values<0]

array([-0.77761941, -1.05108156, -0.36754812, -1.13745969, -1.32214752,
       -0.34745899, -1.04345   , -1.00994188, -1.83806777, -0.93876863])

In [87]:
#get row and column name of all the negatives values

for i in data3.columns:
   for j in data3.index:
     for k in data3.values[data3.values<0]:
       print(k,"----",(i,j))

-0.7776194131918178 ---- (0, 0)
-1.0510815639071178 ---- (0, 0)
-0.3675481161171661 ---- (0, 0)
-1.1374596907250272 ---- (0, 0)
-1.3221475225908594 ---- (0, 0)
-0.34745899102186334 ---- (0, 0)
-1.0434500017467254 ---- (0, 0)
-1.0099418765878465 ---- (0, 0)
-1.8380677677579502 ---- (0, 0)
-0.9387686311201282 ---- (0, 0)
-0.7776194131918178 ---- (0, 1)
-1.0510815639071178 ---- (0, 1)
-0.3675481161171661 ---- (0, 1)
-1.1374596907250272 ---- (0, 1)
-1.3221475225908594 ---- (0, 1)
-0.34745899102186334 ---- (0, 1)
-1.0434500017467254 ---- (0, 1)
-1.0099418765878465 ---- (0, 1)
-1.8380677677579502 ---- (0, 1)
-0.9387686311201282 ---- (0, 1)
-0.7776194131918178 ---- (0, 2)
-1.0510815639071178 ---- (0, 2)
-0.3675481161171661 ---- (0, 2)
-1.1374596907250272 ---- (0, 2)
-1.3221475225908594 ---- (0, 2)
-0.34745899102186334 ---- (0, 2)
-1.0434500017467254 ---- (0, 2)
-1.0099418765878465 ---- (0, 2)
-1.8380677677579502 ---- (0, 2)
-0.9387686311201282 ---- (0, 2)
-0.7776194131918178 ---- (0, 3)
-1.0510815639071178 ---- (0, 3)
-0.3675481161171661 ---- (0, 3)
-1.1374596907250272 ---- (0, 3)
-1.3221475225908594 ---- (0, 3)
-0.34745899102186334 ---- (0, 3)
-1.0434500017467254 ---- (0, 3)
-1.0099418765878465 ---- (0, 3)
-1.8380677677579502 ---- (0, 3)
-0.9387686311201282 ---- (0, 3)
-0.7776194131918178 ---- (1, 0)
-1.0510815639071178 ---- (1, 0)
-0.3675481161171661 ---- (1, 0)
-1.1374596907250272 ---- (1, 0)
-1.3221475225908594 ---- (1, 0)
-0.34745899102186334 ---- (1, 0)
-1.0434500017467254 ---- (1, 0)
-1.0099418765878465 ---- (1, 0)
-1.8380677677579502 ---- (1, 0)
-0.9387686311201282 ---- (1, 0)
-0.7776194131918178 ---- (1, 1)
-1.0510815639071178 ---- (1, 1)
-0.3675481161171661 ---- (1, 1)
-1.1374596907250272 ---- (1, 1)
-1.3221475225908594 ---- (1, 1)
-0.34745899102186334 ---- (1, 1)
-1.0434500017467254 ---- (1, 1)
-1.0099418765878465 ---- (1, 1)
-1.8380677677579502 ---- (1, 1)
-0.9387686311201282 ---- (1, 1)
-0.7776194131918178 ---- (1, 2)
-1.0510815639071178 ---- (1, 2)
-0.3675481161171661 ---- (1, 2)
-1.1374596907250272 ---- (1, 2)
-1.3221475225908594 ---- (1, 2)
-0.34745899102186334 ---- (1, 2)
-1.0434500017467254 ---- (1, 2)
-1.0099418765878465 ---- (1, 2)
-1.8380677677579502 ---- (1, 2)
-0.9387686311201282 ---- (1, 2)
-0.7776194131918178 ---- (1, 3)
-1.0510815639071178 ---- (1, 3)
-0.3675481161171661 ---- (1, 3)
-1.1374596907250272 ---- (1, 3)
-1.3221475225908594 ---- (1, 3)
-0.34745899102186334 ---- (1, 3)
-1.0434500017467254 ---- (1, 3)
-1.0099418765878465 ---- (1, 3)
-1.8380677677579502 ---- (1, 3)
-0.9387686311201282 ---- (1, 3)
-0.7776194131918178 ---- (2, 0)
-1.0510815639071178 ---- (2, 0)
-0.3675481161171661 ---- (2, 0)
-1.1374596907250272 ---- (2, 0)
-1.3221475225908594 ---- (2, 0)
-0.34745899102186334 ---- (2, 0)
-1.0434500017467254 ---- (2, 0)
-1.0099418765878465 ---- (2, 0)
-1.8380677677579502 ---- (2, 0)
-0.9387686311201282 ---- (2, 0)
-0.7776194131918178 ---- (2, 1)
-1.0510815639071178 ---- (2, 1)
-0.3675481161171661 ---- (2, 1)
-1.1374596907250272 ---- (2, 1)
-1.3221475225908594 ---- (2, 1)
-0.34745899102186334 ---- (2, 1)
-1.0434500017467254 ---- (2, 1)
-1.0099418765878465 ---- (2, 1)
-1.8380677677579502 ---- (2, 1)
-0.9387686311201282 ---- (2, 1)
-0.7776194131918178 ---- (2, 2)
-1.0510815639071178 ---- (2, 2)
-0.3675481161171661 ---- (2, 2)
-1.1374596907250272 ---- (2, 2)
-1.3221475225908594 ---- (2, 2)
-0.34745899102186334 ---- (2, 2)
-1.0434500017467254 ---- (2, 2)
-1.0099418765878465 ---- (2, 2)
-1.8380677677579502 ---- (2, 2)
-0.9387686311201282 ---- (2, 2)
-0.7776194131918178 ---- (2, 3)
-1.0510815639071178 ---- (2, 3)
-0.3675481161171661 ---- (2, 3)
-1.1374596907250272 ---- (2, 3)
-1.3221475225908594 ---- (2, 3)
-0.34745899102186334 ---- (2, 3)
-1.0434500017467254 ---- (2, 3)
-1.0099418765878465 ---- (2, 3)
-1.8380677677579502 ---- (2, 3)
-0.9387686311201282 ---- (2, 3)
-0.7776194131918178 ---- (3, 0)
-1.0510815639071178 ---- (3, 0)
-0.3675481161171661 ---- (3, 0)
-1.1374596907250272 ---- (3, 0)
-1.3221475225908594 ---- (3, 0)
-0.34745899102186334 ---- (3, 0)
-1.0434500017467254 ---- (3, 0)
-1.0099418765878465 ---- (3, 0)
-1.8380677677579502 ---- (3, 0)
-0.9387686311201282 ---- (3, 0)
-0.7776194131918178 ---- (3, 1)
-1.0510815639071178 ---- (3, 1)
-0.3675481161171661 ---- (3, 1)
-1.1374596907250272 ---- (3, 1)
-1.3221475225908594 ---- (3, 1)
-0.34745899102186334 ---- (3, 1)
-1.0434500017467254 ---- (3, 1)
-1.0099418765878465 ---- (3, 1)
-1.8380677677579502 ---- (3, 1)
-0.9387686311201282 ---- (3, 1)
-0.7776194131918178 ---- (3, 2)
-1.0510815639071178 ---- (3, 2)
-0.3675481161171661 ---- (3, 2)
-1.1374596907250272 ---- (3, 2)
-1.3221475225908594 ---- (3, 2)
-0.34745899102186334 ---- (3, 2)
-1.0434500017467254 ---- (3, 2)
-1.0099418765878465 ---- (3, 2)
-1.8380677677579502 ---- (3, 2)
-0.9387686311201282 ---- (3, 2)
-0.7776194131918178 ---- (3, 3)
-1.0510815639071178 ---- (3, 3)
-0.3675481161171661 ---- (3, 3)
-1.1374596907250272 ---- (3, 3)
-1.3221475225908594 ---- (3, 3)
-0.34745899102186334 ---- (3, 3)
-1.0434500017467254 ---- (3, 3)
-1.0099418765878465 ---- (3, 3)
-1.8380677677579502 ---- (3, 3)
-0.9387686311201282 ---- (3, 3)
-0.7776194131918178 ---- (4, 0)
-1.0510815639071178 ---- (4, 0)
-0.3675481161171661 ---- (4, 0)
-1.1374596907250272 ---- (4, 0)
-1.3221475225908594 ---- (4, 0)
-0.34745899102186334 ---- (4, 0)
-1.0434500017467254 ---- (4, 0)
-1.0099418765878465 ---- (4, 0)
-1.8380677677579502 ---- (4, 0)
-0.9387686311201282 ---- (4, 0)
-0.7776194131918178 ---- (4, 1)
-1.0510815639071178 ---- (4, 1)
-0.3675481161171661 ---- (4, 1)
-1.1374596907250272 ---- (4, 1)
-1.3221475225908594 ---- (4, 1)
-0.34745899102186334 ---- (4, 1)
-1.0434500017467254 ---- (4, 1)
-1.0099418765878465 ---- (4, 1)
-1.8380677677579502 ---- (4, 1)
-0.9387686311201282 ---- (4, 1)
-0.7776194131918178 ---- (4, 2)
-1.0510815639071178 ---- (4, 2)
-0.3675481161171661 ---- (4, 2)
-1.1374596907250272 ---- (4, 2)
-1.3221475225908594 ---- (4, 2)
-0.34745899102186334 ---- (4, 2)
-1.0434500017467254 ---- (4, 2)
-1.0099418765878465 ---- (4, 2)
-1.8380677677579502 ---- (4, 2)
-0.9387686311201282 ---- (4, 2)
-0.7776194131918178 ---- (4, 3)
-1.0510815639071178 ---- (4, 3)
-0.3675481161171661 ---- (4, 3)
-1.1374596907250272 ---- (4, 3)
-1.3221475225908594 ---- (4, 3)
-0.34745899102186334 ---- (4, 3)
-1.0434500017467254 ---- (4, 3)
-1.0099418765878465 ---- (4, 3)
-1.8380677677579502 ---- (4, 3)
-0.9387686311201282 ---- (4, 3)

In [88]:
for i in data3.columns:
  for j in data3.index:
    if data3.loc[i,j]<0:
      print(i,j,data3.loc[j,i])

0 2 -0.34745899102186334
1 0 0.02581308106627382
1 1 -0.3675481161171661
1 2 0.6701401628971514
1 3 0.44173637238220625
2 0 -0.7776194131918178
3 0 0.9486338224949431
3 3 -1.8380677677579502

KeyError: 4

In [89]:
d={'key1':[1,2,3,4,np.nan],"key2":["hasmukh","mer",4,5,6],"key3":[np.nan,np.nan,np.nan,3,2]}

data4=pd.DataFrame(d)
data4

   key1     key2  key3
0   1.0  hasmukh   NaN
1   2.0      mer   NaN
2   3.0        4   NaN
3   4.0        5   3.0
4   NaN        6   2.0

In [90]:
# Drop  NaN values
data4.dropna()

   key1 key2  key3
3   4.0    5   3.0

In [91]:
data4.dropna(axis=1)

      key2
0  hasmukh
1      mer
2        4
3        5
4        6

In [92]:
data4.dropna(thresh=0)

   key1     key2  key3
0   1.0  hasmukh   NaN
1   2.0      mer   NaN
2   3.0        4   NaN
3   4.0        5   3.0
4   NaN        6   2.0

In [93]:
data4.dropna(thresh=1)

   key1     key2  key3
0   1.0  hasmukh   NaN
1   2.0      mer   NaN
2   3.0        4   NaN
3   4.0        5   3.0
4   NaN        6   2.0

In [94]:
data4.dropna(thresh=2)

   key1     key2  key3
0   1.0  hasmukh   NaN
1   2.0      mer   NaN
2   3.0        4   NaN
3   4.0        5   3.0
4   NaN        6   2.0

In [95]:
data4.dropna(thresh=3)

   key1 key2  key3
3   4.0    5   3.0

In [96]:
data4.dropna(thresh=4)

Empty DataFrame
Columns: [key1, key2, key3]
Index: []

In [97]:
data4.dropna(thresh=3,axis=1)

   key1     key2
0   1.0  hasmukh
1   2.0      mer
2   3.0        4
3   4.0        5
4   NaN        6

In [98]:
#fill Nan Values  
data4.fillna("hasmukh")

      key1     key2     key3
0      1.0  hasmukh  hasmukh
1      2.0      mer  hasmukh
2      3.0        4  hasmukh
3      4.0        5      3.0
4  hasmukh        6      2.0

In [99]:
data4.fillna(data4['key3'].mean())

   key1     key2  key3
0   1.0  hasmukh   2.5
1   2.0      mer   2.5
2   3.0        4   2.5
3   4.0        5   3.0
4   2.5        6   2.0

In [100]:
d1={'name':['hasmukh','ravi','kapil','amit','hasmukh'],'mail_id':['hasmukh@gmail.com','ravi@gmail.com','kapil@gmail.com','amit@gmail.com','hasmkh@gmail.com'],
    'salary':[100,200,500,300,100]}


data5=pd.DataFrame(d1)
data5

      name            mail_id  salary
0  hasmukh  hasmukh@gmail.com     100
1     ravi     ravi@gmail.com     200
2    kapil    kapil@gmail.com     500
3     amit     amit@gmail.com     300
4  hasmukh   hasmkh@gmail.com     100

In [101]:
#average salary of given name 
data5.groupby('name').mean()

         salary
name
amit      300.0
hasmukh   100.0
kapil     500.0
ravi      200.0

In [102]:
#average sum of salary of given name 
data5.groupby('name').sum()

         salary
name
amit        300
hasmukh     200
kapil       500
ravi        200

In [103]:
data5.groupby('name').describe()

        salary
         count   mean  std    min    25%    50%    75%    max
name
amit       1.0  300.0  NaN  300.0  300.0  300.0  300.0  300.0
hasmukh    2.0  100.0  0.0  100.0  100.0  100.0  100.0  100.0
kapil      1.0  500.0  NaN  500.0  500.0  500.0  500.0  500.0
ravi       1.0  200.0  NaN  200.0  200.0  200.0  200.0  200.0

In [104]:

data5.groupby('name').describe().loc['hasmukh']

salary  count      2.0
        mean     100.0
        std        0.0
        min      100.0
        25%      100.0
        50%      100.0
        75%      100.0
        max      100.0
Name: hasmukh, dtype: float64

In [105]:
data5.groupby('name').describe().loc['hasmukh']['salary']['mean']

100.0

In [106]:
#transpose
data5.groupby('name').describe().T

name           amit  hasmukh  kapil   ravi
salary count    1.0      2.0    1.0    1.0
       mean   300.0    100.0  500.0  200.0
       std      NaN      0.0    NaN    NaN
       min    300.0    100.0  500.0  200.0
       25%    300.0    100.0  500.0  200.0
       50%    300.0    100.0  500.0  200.0
       75%    300.0    100.0  500.0  200.0
       max    300.0    100.0  500.0  200.0

In [107]:
arr1=np.random.randn(3,4)
arr1

array([[-0.20184052,  1.04537128,  0.53816197,  0.81211867],
       [ 0.2411063 , -0.95250953, -0.13626676,  1.26724821],
       [ 0.17363364, -1.22325477,  1.41531998,  0.45771098]])

In [108]:
arr2=np.random.randn(3,4)
arr2

array([[ 0.72887584,  1.96843473, -0.54778801, -0.67941827],
       [-2.50623032,  0.14696049,  0.60619549, -0.02253889],
       [ 0.01342226,  0.93594489,  0.42062266,  0.41161964]])

In [109]:
arr3=np.random.randn(3,4)
arr3

array([[-0.07132392, -0.04543758,  1.04088597, -0.09403473],
       [-0.42084395, -0.55198856, -0.12109755,  0.19014136],
       [ 0.51213739,  0.13153847, -0.33161712, -1.63238628]])

In [110]:
df1=pd.DataFrame(arr1,columns=["A","B","C","D"],index=[0,1,2])
df1

          A         B         C         D
0 -0.201841  1.045371  0.538162  0.812119
1  0.241106 -0.952510 -0.136267  1.267248
2  0.173634 -1.223255  1.415320  0.457711

In [111]:
df2=pd.DataFrame(arr2,columns=["A","B","C","D"],index=[0,1,2])
df2

          A         B         C         D
0  0.728876  1.968435 -0.547788 -0.679418
1 -2.506230  0.146960  0.606195 -0.022539
2  0.013422  0.935945  0.420623  0.411620

In [112]:
df3=pd.DataFrame(arr3,columns=["A","B","C","D"],index=[0,1,2])
df3

          A         B         C         D
0 -0.071324 -0.045438  1.040886 -0.094035
1 -0.420844 -0.551989 -0.121098  0.190141
2  0.512137  0.131538 -0.331617 -1.632386

In [113]:
df4=pd.concat([df1,df2,df3])
df4

          A         B         C         D
0 -0.201841  1.045371  0.538162  0.812119
1  0.241106 -0.952510 -0.136267  1.267248
2  0.173634 -1.223255  1.415320  0.457711
0  0.728876  1.968435 -0.547788 -0.679418
1 -2.506230  0.146960  0.606195 -0.022539
2  0.013422  0.935945  0.420623  0.411620
0 -0.071324 -0.045438  1.040886 -0.094035
1 -0.420844 -0.551989 -0.121098  0.190141
2  0.512137  0.131538 -0.331617 -1.632386

In [114]:
df5=pd.concat([df1,df2,df3],axis=1)
df5

,A,B,C,D,A,B,C,D,A,B,C,D
0,-0.201841,1.045371,0.538162,0.812119,0.728876,1.968435,-0.547788,-0.679418,-0.071324,-0.045438,1.040886,-0.094035
1,0.241106,-0.952510,-0.136267,1.267248,-2.506230,0.146960,0.606195,-0.022539,-0.420844,-0.551989,-0.121098,0.190141
2,0.173634,-1.223255,1.415320,0.457711,0.013422,0.935945,0.420623,0.411620,0.512137,0.131538,-0.331617,-1.632386

In [115]:
df4.iloc[0]

A   -0.201841
B    1.045371
C    0.538162
D    0.812119
Name: 0, dtype: float64

In [116]:
df4.loc[0]

          A         B         C         D
0 -0.201841  1.045371  0.538162  0.812119
0  0.728876  1.968435 -0.547788 -0.679418
0 -0.071324 -0.045438  1.040886 -0.094035

In [117]:
df5

,A,B,C,D,A,B,C,D,A,B,C,D
0,-0.201841,1.045371,0.538162,0.812119,0.728876,1.968435,-0.547788,-0.679418,-0.071324,-0.045438,1.040886,-0.094035
1,0.241106,-0.952510,-0.136267,1.267248,-2.506230,0.146960,0.606195,-0.022539,-0.420844,-0.551989,-0.121098,0.190141
2,0.173634,-1.223255,1.415320,0.457711,0.013422,0.935945,0.420623,0.411620,0.512137,0.131538,-0.331617,-1.632386

In [118]:
df5['A']

          A         A         A
0 -0.201841  0.728876 -0.071324
1  0.241106 -2.506230 -0.420844
2  0.173634  0.013422  0.512137

In [119]:
df5.iloc[:,4] #second A

0    0.728876
1   -2.506230
2    0.013422
Name: A, dtype: float64

In [120]:
np.random.seed(23)
arr1=np.random.randn(3,4)
np.random.seed(23)
arr1=np.random.randn(3,4)
df11=pd.DataFrame(arr3,columns=["A","B","C","D"],index=[0,1,2])
df22=pd.DataFrame(arr3,columns=["A","B","C","D"],index=[3,4,5])

In [121]:
df11

          A         B         C         D
0 -0.071324 -0.045438  1.040886 -0.094035
1 -0.420844 -0.551989 -0.121098  0.190141
2  0.512137  0.131538 -0.331617 -1.632386

In [122]:
df22

          A         B         C         D
3 -0.071324 -0.045438  1.040886 -0.094035
4 -0.420844 -0.551989 -0.121098  0.190141
5  0.512137  0.131538 -0.331617 -1.632386

In [123]:
pd.merge(df11,df22,on='A')

          A       B_x       C_x       D_x       B_y       C_y       D_y
0 -0.071324 -0.045438  1.040886 -0.094035 -0.045438  1.040886 -0.094035
1 -0.420844 -0.551989 -0.121098  0.190141 -0.551989 -0.121098  0.190141
2  0.512137  0.131538 -0.331617 -1.632386  0.131538 -0.331617 -1.632386

In [124]:
import numpy as np
import pandas as pd

In [125]:
np.random.seed(20)
df=pd.DataFrame(np.random.randn(10,4),index=pd.date_range('2021-07-18',periods=10),columns=['a','b','c','d'])
df

                   a         b         c         d
2021-07-18  0.883893  0.195865  0.357537 -2.343262
2021-07-19 -1.084833  0.559696  0.939469 -0.978481
2021-07-20  0.503097  0.406414  0.323461 -0.493411
2021-07-21 -0.792017 -0.842368 -1.279503  0.245715
2021-07-22 -0.044195  1.567633  1.051109  0.406368
2021-07-23 -0.168646 -3.189703  1.120132  1.332778
2021-07-24 -0.243339 -0.130031 -0.109017  1.556186
2021-07-25  0.128778 -2.066949 -0.885493 -1.104579
2021-07-26  0.932866  2.059838 -0.934938 -1.612990
2021-07-27  0.527070 -1.551101  0.329613 -1.136527

In [126]:
df['new']=df['c']+df['d']

In [127]:
df

                   a         b         c         d       new
2021-07-18  0.883893  0.195865  0.357537 -2.343262 -1.985725
2021-07-19 -1.084833  0.559696  0.939469 -0.978481 -0.039012
2021-07-20  0.503097  0.406414  0.323461 -0.493411 -0.169950
2021-07-21 -0.792017 -0.842368 -1.279503  0.245715 -1.033787
2021-07-22 -0.044195  1.567633  1.051109  0.406368  1.457477
2021-07-23 -0.168646 -3.189703  1.120132  1.332778  2.452910
2021-07-24 -0.243339 -0.130031 -0.109017  1.556186  1.447169
2021-07-25  0.128778 -2.066949 -0.885493 -1.104579 -1.990073
2021-07-26  0.932866  2.059838 -0.934938 -1.612990 -2.547928
2021-07-27  0.527070 -1.551101  0.329613 -1.136527 -0.806913

In [128]:
df['new_square_column_d']=df['d'].apply(lambda x : x**2)

In [129]:
df

,a,b,c,d,new,new_square_column_d
2021-07-18,0.883893,0.195865,0.357537,-2.343262,-1.985725,5.490876
2021-07-19,-1.084833,0.559696,0.939469,-0.978481,-0.039012,0.957425
2021-07-20,0.503097,0.406414,0.323461,-0.493411,-0.169950,0.243454
2021-07-21,-0.792017,-0.842368,-1.279503,0.245715,-1.033787,0.060376
2021-07-22,-0.044195,1.567633,1.051109,0.406368,1.457477,0.165135
2021-07-23,-0.168646,-3.189703,1.120132,1.332778,2.452910,1.776298
2021-07-24,-0.243339,-0.130031,-0.109017,1.556186,1.447169,2.421716
2021-07-25,0.128778,-2.066949,-0.885493,-1.104579,-1.990073,1.220096
2021-07-26,0.932866,2.059838,-0.934938,-1.612990,-2.547928,2.601737
2021-07-27,0.527070,-1.551101,0.329613,-1.136527,-0.806913,1.291693

In [130]:
df['new_log_column_d']=df['d'].apply(lambda x : np.log(x))

In [131]:
df

,a,b,c,d,new,new_square_column_d,new_log_column_d
2021-07-18,0.883893,0.195865,0.357537,-2.343262,-1.985725,5.490876,NaN
2021-07-19,-1.084833,0.559696,0.939469,-0.978481,-0.039012,0.957425,NaN
2021-07-20,0.503097,0.406414,0.323461,-0.493411,-0.169950,0.243454,NaN
2021-07-21,-0.792017,-0.842368,-1.279503,0.245715,-1.033787,0.060376,-1.403582
2021-07-22,-0.044195,1.567633,1.051109,0.406368,1.457477,0.165135,-0.900495
2021-07-23,-0.168646,-3.189703,1.120132,1.332778,2.452910,1.776298,0.287266
2021-07-24,-0.243339,-0.130031,-0.109017,1.556186,1.447169,2.421716,0.442238
2021-07-25,0.128778,-2.066949,-0.885493,-1.104579,-1.990073,1.220096,NaN
2021-07-26,0.932866,2.059838,-0.934938,-1.612990,-2.547928,2.601737,NaN
2021-07-27,0.527070,-1.551101,0.329613,-1.136527,-0.806913,1.291693,NaN

In [132]:
def test(x):
  if (x<0):
    return x
  else:
    return np.log(x)

In [133]:
df['new_log_column_d_2']=df['d'].apply(test)

In [134]:
df

,a,b,c,d,new,new_square_column_d,new_log_column_d,new_log_column_d_2
2021-07-18,0.883893,0.195865,0.357537,-2.343262,-1.985725,5.490876,NaN,-2.343262
2021-07-19,-1.084833,0.559696,0.939469,-0.978481,-0.039012,0.957425,NaN,-0.978481
2021-07-20,0.503097,0.406414,0.323461,-0.493411,-0.169950,0.243454,NaN,-0.493411
2021-07-21,-0.792017,-0.842368,-1.279503,0.245715,-1.033787,0.060376,-1.403582,-1.403582
2021-07-22,-0.044195,1.567633,1.051109,0.406368,1.457477,0.165135,-0.900495,-0.900495
2021-07-23,-0.168646,-3.189703,1.120132,1.332778,2.452910,1.776298,0.287266,0.287266
2021-07-24,-0.243339,-0.130031,-0.109017,1.556186,1.447169,2.421716,0.442238,0.442238
2021-07-25,0.128778,-2.066949,-0.885493,-1.104579,-1.990073,1.220096,NaN,-1.104579
2021-07-26,0.932866,2.059838,-0.934938,-1.612990,-2.547928,2.601737,NaN,-1.612990
2021-07-27,0.527070,-1.551101,0.329613,-1.136527,-0.806913,1.291693,NaN,-1.136527

In [135]:
def test1(x):
  if x<=0:
    return 1
  else:
    return 0

In [136]:
df['new_a']=df['a'].apply(test1)

In [137]:
df

,a,b,c,d,new,new_square_column_d,new_log_column_d,new_log_column_d_2,new_a
2021-07-18,0.883893,0.195865,0.357537,-2.343262,-1.985725,5.490876,NaN,-2.343262,0
2021-07-19,-1.084833,0.559696,0.939469,-0.978481,-0.039012,0.957425,NaN,-0.978481,1
2021-07-20,0.503097,0.406414,0.323461,-0.493411,-0.169950,0.243454,NaN,-0.493411,0
2021-07-21,-0.792017,-0.842368,-1.279503,0.245715,-1.033787,0.060376,-1.403582,-1.403582,1
2021-07-22,-0.044195,1.567633,1.051109,0.406368,1.457477,0.165135,-0.900495,-0.900495,1
2021-07-23,-0.168646,-3.189703,1.120132,1.332778,2.452910,1.776298,0.287266,0.287266,1
2021-07-24,-0.243339,-0.130031,-0.109017,1.556186,1.447169,2.421716,0.442238,0.442238,1
2021-07-25,0.128778,-2.066949,-0.885493,-1.104579,-1.990073,1.220096,NaN,-1.104579,0
2021-07-26,0.932866,2.059838,-0.934938,-1.612990,-2.547928,2.601737,NaN,-1.612990,0
2021-07-27,0.527070,-1.551101,0.329613,-1.136527,-0.806913,1.291693,NaN,-1.136527,0

In [138]:
df.sort_values(by='b')

,a,b,c,d,new,new_square_column_d,new_log_column_d,new_log_column_d_2,new_a
2021-07-23,-0.168646,-3.189703,1.120132,1.332778,2.452910,1.776298,0.287266,0.287266,1
2021-07-25,0.128778,-2.066949,-0.885493,-1.104579,-1.990073,1.220096,NaN,-1.104579,0
2021-07-27,0.527070,-1.551101,0.329613,-1.136527,-0.806913,1.291693,NaN,-1.136527,0
2021-07-21,-0.792017,-0.842368,-1.279503,0.245715,-1.033787,0.060376,-1.403582,-1.403582,1
2021-07-24,-0.243339,-0.130031,-0.109017,1.556186,1.447169,2.421716,0.442238,0.442238,1
2021-07-18,0.883893,0.195865,0.357537,-2.343262,-1.985725,5.490876,NaN,-2.343262,0
2021-07-20,0.503097,0.406414,0.323461,-0.493411,-0.169950,0.243454,NaN,-0.493411,0
2021-07-19,-1.084833,0.559696,0.939469,-0.978481,-0.039012,0.957425,NaN,-0.978481,1
2021-07-22,-0.044195,1.567633,1.051109,0.406368,1.457477,0.165135,-0.900495,-0.900495,1
2021-07-26,0.932866,2.059838,-0.934938,-1.612990,-2.547928,2.601737,NaN,-1.612990,0

In [139]:
df.index

DatetimeIndex(['2021-07-18', '2021-07-19', '2021-07-20', '2021-07-21',
               '2021-07-22', '2021-07-23', '2021-07-24', '2021-07-25',
               '2021-07-26', '2021-07-27'],
              dtype='datetime64[ns]', freq='D')

In [140]:
df.T

,2021-07-18,2021-07-19,2021-07-20,2021-07-21,2021-07-22,2021-07-23,2021-07-24,2021-07-25,2021-07-26,2021-07-27
a,0.883893,-1.084833,0.503097,-0.792017,-0.044195,-0.168646,-0.243339,0.128778,0.932866,0.527070
b,0.195865,0.559696,0.406414,-0.842368,1.567633,-3.189703,-0.130031,-2.066949,2.059838,-1.551101
c,0.357537,0.939469,0.323461,-1.279503,1.051109,1.120132,-0.109017,-0.885493,-0.934938,0.329613
d,-2.343262,-0.978481,-0.493411,0.245715,0.406368,1.332778,1.556186,-1.104579,-1.612990,-1.136527
new,-1.985725,-0.039012,-0.169950,-1.033787,1.457477,2.452910,1.447169,-1.990073,-2.547928,-0.806913
new_square_column_d,5.490876,0.957425,0.243454,0.060376,0.165135,1.776298,2.421716,1.220096,2.601737,1.291693
new_log_column_d,NaN,NaN,NaN,-1.403582,-0.900495,0.287266,0.442238,NaN,NaN,NaN
new_log_column_d_2,-2.343262,-0.978481,-0.493411,-1.403582,-0.900495,0.287266,0.442238,-1.104579,-1.612990,-1.136527
new_a,0.000000,1.000000,0.000000,1.000000,1.000000,1.000000,1.000000,0.000000,0.000000,0.000000

In [141]:
df

,a,b,c,d,new,new_square_column_d,new_log_column_d,new_log_column_d_2,new_a
2021-07-18,0.883893,0.195865,0.357537,-2.343262,-1.985725,5.490876,NaN,-2.343262,0
2021-07-19,-1.084833,0.559696,0.939469,-0.978481,-0.039012,0.957425,NaN,-0.978481,1
2021-07-20,0.503097,0.406414,0.323461,-0.493411,-0.169950,0.243454,NaN,-0.493411,0
2021-07-21,-0.792017,-0.842368,-1.279503,0.245715,-1.033787,0.060376,-1.403582,-1.403582,1
2021-07-22,-0.044195,1.567633,1.051109,0.406368,1.457477,0.165135,-0.900495,-0.900495,1
2021-07-23,-0.168646,-3.189703,1.120132,1.332778,2.452910,1.776298,0.287266,0.287266,1
2021-07-24,-0.243339,-0.130031,-0.109017,1.556186,1.447169,2.421716,0.442238,0.442238,1
2021-07-25,0.128778,-2.066949,-0.885493,-1.104579,-1.990073,1.220096,NaN,-1.104579,0
2021-07-26,0.932866,2.059838,-0.934938,-1.612990,-2.547928,2.601737,NaN,-1.612990,0
2021-07-27,0.527070,-1.551101,0.329613,-1.136527,-0.806913,1.291693,NaN,-1.136527,0

In [142]:
df['new_date']=df.index
df

,a,b,c,d,new,new_square_column_d,new_log_column_d,new_log_column_d_2,new_a,new_date
2021-07-18,0.883893,0.195865,0.357537,-2.343262,-1.985725,5.490876,NaN,-2.343262,0,2021-07-18
2021-07-19,-1.084833,0.559696,0.939469,-0.978481,-0.039012,0.957425,NaN,-0.978481,1,2021-07-19
2021-07-20,0.503097,0.406414,0.323461,-0.493411,-0.169950,0.243454,NaN,-0.493411,0,2021-07-20
2021-07-21,-0.792017,-0.842368,-1.279503,0.245715,-1.033787,0.060376,-1.403582,-1.403582,1,2021-07-21
2021-07-22,-0.044195,1.567633,1.051109,0.406368,1.457477,0.165135,-0.900495,-0.900495,1,2021-07-22
2021-07-23,-0.168646,-3.189703,1.120132,1.332778,2.452910,1.776298,0.287266,0.287266,1,2021-07-23
2021-07-24,-0.243339,-0.130031,-0.109017,1.556186,1.447169,2.421716,0.442238,0.442238,1,2021-07-24
2021-07-25,0.128778,-2.066949,-0.885493,-1.104579,-1.990073,1.220096,NaN,-1.104579,0,2021-07-25
2021-07-26,0.932866,2.059838,-0.934938,-1.612990,-2.547928,2.601737,NaN,-1.612990,0,2021-07-26
2021-07-27,0.527070,-1.551101,0.329613,-1.136527,-0.806913,1.291693,NaN,-1.136527,0,2021-07-27

In [143]:
df.dtypes

a                             float64
b                             float64
c                             float64
d                             float64
new                           float64
new_square_column_d           float64
new_log_column_d              float64
new_log_column_d_2            float64
new_a                           int64
new_date               datetime64[ns]
dtype: object

In [144]:
df['day']=df.index.day
df['month']=df.index.month
df['year']=df.index.year

In [145]:
df

,a,b,c,d,new,new_square_column_d,new_log_column_d,new_log_column_d_2,new_a,new_date,day,month,year
2021-07-18,0.883893,0.195865,0.357537,-2.343262,-1.985725,5.490876,NaN,-2.343262,0,2021-07-18,18,7,2021
2021-07-19,-1.084833,0.559696,0.939469,-0.978481,-0.039012,0.957425,NaN,-0.978481,1,2021-07-19,19,7,2021
2021-07-20,0.503097,0.406414,0.323461,-0.493411,-0.169950,0.243454,NaN,-0.493411,0,2021-07-20,20,7,2021
2021-07-21,-0.792017,-0.842368,-1.279503,0.245715,-1.033787,0.060376,-1.403582,-1.403582,1,2021-07-21,21,7,2021
2021-07-22,-0.044195,1.567633,1.051109,0.406368,1.457477,0.165135,-0.900495,-0.900495,1,2021-07-22,22,7,2021
2021-07-23,-0.168646,-3.189703,1.120132,1.332778,2.452910,1.776298,0.287266,0.287266,1,2021-07-23,23,7,2021
2021-07-24,-0.243339,-0.130031,-0.109017,1.556186,1.447169,2.421716,0.442238,0.442238,1,2021-07-24,24,7,2021
2021-07-25,0.128778,-2.066949,-0.885493,-1.104579,-1.990073,1.220096,NaN,-1.104579,0,2021-07-25,25,7,2021
2021-07-26,0.932866,2.059838,-0.934938,-1.612990,-2.547928,2.601737,NaN,-1.612990,0,2021-07-26,26,7,2021
2021-07-27,0.527070,-1.551101,0.329613,-1.136527,-0.806913,1.291693,NaN,-1.136527,0,2021-07-27,27,7,2021

In [146]:
df['day_name']=df.index.day_name()

In [147]:
df

,a,b,c,d,new,new_square_column_d,new_log_column_d,new_log_column_d_2,new_a,new_date,day,month,year,day_name
2021-07-18,0.883893,0.195865,0.357537,-2.343262,-1.985725,5.490876,NaN,-2.343262,0,2021-07-18,18,7,2021,Sunday
2021-07-19,-1.084833,0.559696,0.939469,-0.978481,-0.039012,0.957425,NaN,-0.978481,1,2021-07-19,19,7,2021,Monday
2021-07-20,0.503097,0.406414,0.323461,-0.493411,-0.169950,0.243454,NaN,-0.493411,0,2021-07-20,20,7,2021,Tuesday
2021-07-21,-0.792017,-0.842368,-1.279503,0.245715,-1.033787,0.060376,-1.403582,-1.403582,1,2021-07-21,21,7,2021,Wednesday
2021-07-22,-0.044195,1.567633,1.051109,0.406368,1.457477,0.165135,-0.900495,-0.900495,1,2021-07-22,22,7,2021,Thursday
2021-07-23,-0.168646,-3.189703,1.120132,1.332778,2.452910,1.776298,0.287266,0.287266,1,2021-07-23,23,7,2021,Friday
2021-07-24,-0.243339,-0.130031,-0.109017,1.556186,1.447169,2.421716,0.442238,0.442238,1,2021-07-24,24,7,2021,Saturday
2021-07-25,0.128778,-2.066949,-0.885493,-1.104579,-1.990073,1.220096,NaN,-1.104579,0,2021-07-25,25,7,2021,Sunday
2021-07-26,0.932866,2.059838,-0.934938,-1.612990,-2.547928,2.601737,NaN,-1.612990,0,2021-07-26,26,7,2021,Monday
2021-07-27,0.527070,-1.551101,0.329613,-1.136527,-0.806913,1.291693,NaN,-1.136527,0,2021-07-27,27,7,2021,Tuesday

In [148]:
df.groupby('day_name').count()

,a,b,c,d,new,new_square_column_d,new_log_column_d,new_log_column_d_2,new_a,new_date,day,month,year
day_name,,,,,,,,,,,,,
Friday,1,1,1,1,1,1,1,1,1,1,1,1,1
Monday,2,2,2,2,2,2,0,2,2,2,2,2,2
Saturday,1,1,1,1,1,1,1,1,1,1,1,1,1
Sunday,2,2,2,2,2,2,0,2,2,2,2,2,2
Thursday,1,1,1,1,1,1,1,1,1,1,1,1,1
Tuesday,2,2,2,2,2,2,0,2,2,2,2,2,2
Wednesday,1,1,1,1,1,1,1,1,1,1,1,1,1